---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.UniqueElementFailures.ProhibitUniqueElementDeletion
source: html/abaf75dc-a95e-6cc4-5380-5e1fcb7fde6b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.UniqueElementFailures.ProhibitUniqueElementDeletion Property

Internal setting '%1!s!' is required by Revit and has been deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProhibitUniqueElementDeletion { get; }
```